#pragma once

///=================================================
/// Project Constant
///=================================================

// 定义1°对应的编码盘码道数
//#define LINES_PER_ANGLE 36000
#define LINES_PER_ANGLE double(0x1000000 / 360.0)

// 定义每组控制数据的字节数
#define ROWLENGTH_BYTES 14

///=================================================
/// Astronomy Constant
///=================================================

// 定义π
#define PI 3.14159265

// 定义角度转弧度乘数，即 π / 180 （弧度 = 角度 * ToRadian）
#define ToRadian 0.01745329

// 定义弧度转角度乘数，即 180 / π （角度 = 弧度 * ToAngle）
#define ToAngle 57.29577951

// MJD0 简化儒略日 0日
#define MJD0 2415020.0

// J2000 简化儒略日 2000 January 1 at 12h
#define J2000 (2451545.0 - MJD0)

// 1回归年 = 365.2422平太阳日 = 366.2422恒星日
// 1恒星日 = (1 - 1 / 366.2422)平太阳日
// 1平太阳日 = (1 + 1 / 365.2422)恒星日
// SIDERATE 用于转换恒星日与平太阳日
#define SIDERATE 0.9972695677